return {
	current = function()
		local sysinfo = sys.get_sys_info()
		return sysinfo.device_language == "ru" and "ru" or "en"
	end,

	tutorial = {
		call_to_action = {
			ru = {
				"Людишки начали посылать свои жалкие шатлы на другие планеты.",
				"Они могут узнать, что космос не бесконечный!\nНельзя этого допустить!",
				"Ты! Живо сделай что-нибудь!\n\nВозьми космос вон там и положи его перед шатлом, чтобы он не столкнулся с краем бездны!"
			},
			en = {
				"Pury hoomans started launching their space shuttles to other planets.",
				"They must never find out space is not infinite!",
				"You, take an action!\n\nErase space over there and draw it before the shuttle, so it doesn't collide with end of space."
			}
		},
		good_reaction = {
			ru = {
				"Фух, спутник цел...\nКак бы на нас смотрели илюминаты если бы мы не справились?",
				"Теперь это твоя работа.\nБудешь следить за тем, чтобы людишки ничего не подозревали.",
				"Справа шкала паники и шкала твоего космоса.\nНе допусти, чтобы паника достигла максимума!"
			},
			en = {
				"Phew, the shuttle is safe...\nWhat would illuminati think of us?",
				"From now on this is your job.\nLook after hoomans so they dont suspect anything.",
				"On your right are panic bar and space bar.\nDont let the panic to reach maximum!"
			}
		},
		bad_reaction = {
			ru = {
				"Проклятье! Шатл взорвался!\nЧто о нас теперь подумают иллюминаты?",
				"Теперь это твоя работа.\nБудешь следить за тем, чтобы людишки ничего не подозревали.",
				"Справа шкала паники и шкала твоего космоса.\nНе допусти, чтобы паника достигла максимума!"
			},
			en = {
				"Curses! Shuttle exploded!\nWhat whould illuminati think of us?",
				"From now on this is your job.\nLook after hoomans so they dont suspect anything.",
				"On your right are panic bar and space bar.\nDont let the panic to reach maximum!"
			}
		}
	},
	wave_1_start = {
		ru = {
			"Доброе утро стажер.\n",
			"Надеюсь ты прошел обучение и уже знаешь что делать.\n",
			"На всякий случай напоминаю что ты можешь использовать ЛКМ чтобы добавить космос\n",
			"и ПКМ чтобы стирать его.\n Надеюсь ты не завалишь все как твой предшественник."
		},
		en = {
		}
	},
	wave_1_end = {
		ru = {
			"Ну как тебе первый день? Надеюсь отлично. Жду тебя завтра, в то же время.\n",
			"Ах, да!\n",
			"Ты ведь знаешь, что человеки успокаиваются, когда на землю возвращается шатл с синим радаром?"
		},
		en = {
			"Huh? Still not fired?\nGuess, you're doing well.",
			"Nevermind. Have you got the news?\nLEGO has released their Shuttle Constructor Kit, so now shuttles fly twice as far.",
			"But worry not!\nSuperiors took decision to pour off some space for you."
		}
	},
	radar_hint = {
		ru = {
			"Ах, да!\n",
			"Ты ведь знаешь, что человеки успокаиваются, когда на землю возвращается шатл с синим радаром?"
		},
		en = {
			"By the way!\nDid you know, that people calm down when shuttles with blue radar come back to Earth?"
		}
	},
	wave_2_start = {
		ru = {
			"Доброе утро, надеюсь ты уже налил себе кофе и готов приступать.\n",
			"Смотри, это ответственная работа и я ожидаю соответствующего отношения.\n",
			"Но, чтобы упростить тебе задачу, я уговорила ложу дать тебе небольшой запас, можешь не благодарить"
		},
		en = {}
	},
	wave_2_end = {
		ru = {
			"Смотрю ты справился. Конечно я ожидала боольшего, но все же неплохо.\n",
			"Надеюсь завтра результаты будут не хуже."
		},
		en = {}
	},
	wave_3_start = {
		ru = {
			"Привет, ты слышал новость?\n",
			"LEGO выпустили конструктор спутников, и теперь шатлы станут запускать чаще чем раньше.\n",
			"Но не переживай, верхняя ложа решила отсыпать тебе немного космоса, чтобы облегчить задачу."
		},
		en = {}
	},
	wave_3_end = {
		ru = {
			"А ты гораздо лучше прошлого стажера.\nДумаю у тебя есть все шансы пройти испытательный срок"
		},
		en = {}
	},
	wave_4_start = {
		ru = {
			"Дьявол! Ты не поверишь, но какие то олухи забыли включить отражающее поле над Юпитером\n",
			"на время проведения Тенсейшн и теперь НАСА собирается послать свои новые корабли дальше в космос для изучения загадочных огней.\n",
			"Надеюсь ты не сильно расстроен. Зато нам выделили еще немного космоса, не правда ли здорово?"
		},
		en = {}
	},
	wave_4_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_5_start = {
		ru = {
			"Наконец то я в офисе.\n",
			"Ты не поверишь, но у людишек появился какой то новый ученый.\n",
			"Говорят, он смыслит в ракетах.\n",
			"Боюсь что этот Илон, принесет нам много проблем.\n",
			"Ах да, в связи с эти Ложа дала еще немного космоса на всякий случай.",
		},
		en = {}
	},
	wave_5_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_6_start = {
		ru = {
			"Привет.\n",
			"Ты часом недавно не отправлял на землю никаких шуток связанных с пер…ракетной тягой?\n",
			"Не то чтобы я на что то намекала, но из-за того что кто то решил пошутить\n",
			"люди изобрели новый двигатель, из-за чего Ложе пришлось нам выделить еще немного космоса из запасов."  
		},
		en = {}
	},
	wave_6_end = {
		ru = {
			"Хм, тебя ещё не уволили?\n",
			"Наверное, ты хорошо справляешься.\n",
			"Можешь отдыхать на сегодня."
		},
		en = {}
	},
	wave_7_start = {
		ru = {
			"Рада видеть тебя в офисе так рано.\n",
			"Скажи а ты знал что на заводах человеков теперь вместо кофе начали продавать энергетики.\n",
			"Кажется они вообще перестали спать и стали собирать шаттлы еще быстрее.\n",
			"Зато, т.к энергетики принадлежат нам,  мы можем выторговать себе еще немного космоса."
		},
		en = {}
	},
	wave_7_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_8_start = {
		ru = {
			"Привет, ты не поверишь но людишки так увлеклись космосом, что изобрели новый флешмоб спейс-инг\n",
			"и тепреь залетают все дальше и дальше чтобы сделать пару фото.\n",
			"Хорошо хоть что Ложа , услышав об этом, решила дать нам еще немного космической материи."
		},
		en = {}
	},
	wave_8_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_9_start = {
		ru = {
			"Я погляжу, тебе здесь комфортно.\n",
			"А ты слышал новости?\n",
			"Проклятый Илон Маск вывел целую рассу роботов на основе tesla и они теперь работают на его заводах собирая новый корабль и ускоряя предыдущие.\n",
			"В связи с этим начальство распорядило тебе ещё немного космоса."
		},
		en = {}
	},
	wave_9_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_10_start = {
		ru = {
			"Привет, сегодня ты работаешь один в связи с подготовкой важной операции связанной сам знаешь с кем.\n",
			"Не волнуйся, мы немного загрузили НАСА, но некоторые запуски все еще возможны.\n",
			"Т.к ты один в офисе, мы дадим тебе еще немного космоса, на всякий случай."
		},
		en = {}
	},
	wave_10_end = {
		ru = {
			"Кажется мы нашли способ убрать Илона с нашего пути.\n",
			"Надесь он вернется не скоро.\n",
			"Ах да, можешь уже отдыхать, мы саботировали запуск спутников на время операции."
		},
		en = {}
	},
	wave_11_start = {
		ru = {
			"Урааа! Мы смогли убрать его!\n",
			"Наконец то можно расслабиться.\n",
			"Минуту. Что значит Роботы Тесла сошли с конвеера и начали собирать ракеты еще быстрее?\n",
			"Эй, немедленно садись за компьютер и дорисовывай космос пока мы не разберемся с проблемой."
		},
		en = {}
	},
	wave_11_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_12_start = {
		ru = {
			"Эй, кто снова заказал доставку аквазона нам в офис?\n",
			"Я понимаю что это удобно, но Земляне теперь из-за нас расширили своё влияние\n",
			"и ускорили корабли чтобы они успевали доставить нам посылки.\n",
			"Радует что тепреь можно съэкономить и докупить еще космоса всем операторам."
		},
		en = {}
	},
	wave_12_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_13_start = {
		ru = {
			"Доброе утро. Твоей чешуе очень идут круги под веками.\n",
			"Кстати, ты вчера смотрел шоу в котором MC conalds отправляет туры с самыми активными посетителями к дальним планетам?\n",
			"Кажется они даже создали специальные корабли для этого.\n",
			"Как ты думаешь, кто продюссеры этого шоу?\n",
			"Только тсс, а то у нас заберут новую поставку космоса.\n",
			"Если что, я тебе ничего не говорила."
		},
		en = {}
	},
	wave_13_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_14_start = {
		ru = {
			"Привет.  Отличного тебе дня и поздравляю с окончанием испытательного срока.\n",
			"Надеюсь ты рад что теперь ты полноценный член команды и получаешь еще больше привилегий.\n",
			"Ну и, конечно, еще немного космоса."
		},
		en = {}
	},
	wave_14_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_15_start = {
		ru = {
			"Доброе утро. Скажи, у тебя нет какого то плохого предчуствия?\n",
			"Будто бы что то плохое зреет где то в далеке? Надеюсь это погода.\n",
			"В любом случае Директор решила дать нашему отделу еще немного космоса чтобы я не волновалась."
		},
		en = {}
	},
	wave_15_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_16_start = {
		ru = {
			"Чутье меня не обмануло. По какой то причине Людишки смогли изобрести новый двигатель который позволяет достигать наиболее удаленных планет.\n",
			"Странно, ведь они не должны были изобрести его еще лет 100.\n",
			"Надеюсь того космоса что нам выделили на наших подопечных нам хватит."
		},
		en = {}
	},
	wave_16_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_17_start = {
		ru = {
			"ЧЕРТ! ЧЕРТ, ЧЕРТ, ЧЕРТ! Мы узнали в чем дело. Илон ЖИВ!\n",
			"Он пересадил свой мозг в Тесло бота и вынашивал свои планы мщения.\n",
			"Это он изобрел новый двигатель! И не только его!\n",
			"Судя по всему он что то знает и поэтому создал корабль способный перемещаться на огромной скорости.\n",
			"Мало того, благодаря ему новые корабли стали еще быстрее, а его боты объединились под знаменем нового лидера.\n",
			"Ложа выделила нам все что могла, но, боюсь, даже этого может быть недостаточно."
		},
		en = {}
	},
	wave_17_end = {
		ru = {
			"Фух, кажется пронесло. Не знаю как, но ты справился.\n",
			"Мы смогли на некторое время отключить его заводы от сети, но врят ли этого хватит надолго.\n",
			"По крайней мере ты можешь выспаться."
		},
		en = {}
	},
	wave_18_start = {
		ru = {
			"Итак, Илон Собирается использовать всю мощь своей тесла армии ботов против нас.\n",
			"Судя по всему он вознамерился любой ценой раскрыть наш секрет.\n",
			"Надеюсь ты справишся.\n",
			"На всякий случай я сняла немного космоса с полевых агентов, чтобы увеличить наши шансы."
	},
		en = {}
	},
	wave_18_end = {
		ru = {
			"Агенты сообщают что им не удалось захватить Илона.\n",
			"Видимо он переселился на одну из планет чтобы мы не смогли найти его.\n",
			"Но, думаю , рано или поздно это произойдет. Иди отдыхай, кризис миновал."
		},
		en = {}
	},
	wave_19_start = {
		ru = {
			"Привет. Я удивлена, но, кажется, после ситуации с Илоном человеки экстренно поумнели.\n",
			"Только сегодня я услышала что они решили отменить Егэ, что значит что теперь сотрудники на остальных заводах станут умнее и смогут ускорить производство.\n",
			"Радует то что Ложа, понимая важность момента, все таки нашла возможнось выделить нам еще немного космоса."
		},
		en = {}
	},
	wave_19_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_20_start = {
		ru = {
			"Когда эти людишки наконец угомонятся?",
			"Но я не поэтому.\n",
			"Церковь заявила, что бог находится на краю галактики, и теперь шатлы будут летать до самых далёких планет.\n",
			"И да, директор РенТВ просил выдать тебе ещё немного космоса за хорошую работу."
			
		},
		en = {}
	},
	wave_20_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_21_start = {
		ru = {
			"Привет. Только что узнала что для экономии времени все шоу на канале Диковери были объеденены в одно.\n",
			"И теперь людишки строят на скорость шатли попутно планирую разрушить легенды о дальнем космосе.\n",
			"Как ты понимаешь, ничего хорошего это не сулит."
			
		},
		en = {}
	},
	wave_21_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	wave_22_start = {
		ru = {
			"Мы только что поймали зашифрованный сигнал с одной из дальних планет.\n",
			"Судя по всему он содержит чертежи нового двигателя.\n",
			"Готова поспорить что это Маск.  Приступай к работе, нет времени на перекур."
		},
		en = {}
	},
	wave_22_end = {
		ru = {"Спасибо за работу. Можешь отдохнуть. Жду тебя завтра."},
		en = {}
	},
	menu = {
		ru = {
			new_game = "новая игра",
			tutorial = "обучение",
			options  = "настройки",
			authors  = "разработчики",
			quit     = "выход"
		},
		en = {
			new_game = "new game",
			tutorial = "tutorial",
			options  = "options",
			authors  = "authors",
			quit     = "quit"
		}
	},

	pause = {
		ru = {
			text = "ПАУЗА",
			hint = "<space> - выйти в меню\n<esc> - вернуться в игру"
		},
		en = {
			text = "PAUSE",
			hint = "<space> - exit\n<esc> - resume"
		}
	},
	gameover = {
		loose = {
			ru = {
				text = "ТЫ УВОЛЕН",
				hint = "Нажми <Esc> чтобы выйти в меню или <R> чтобы переиграть"
			},
			en = {
				text = "YOU ARE FIRED",
				hint = "Press <Esc> for exit or <R> to replay"
			}
		},
		win = {
			ru = {
				text = "ТЕБЯ ПОВЫСИЛИ",
				hint = "<space> - выйти в меню"
			},
			en = {
				text = "YOU ARE PROMOTED",
				hint = "<space> - exit"
			}
		}
	},


	controls = {
		ru = "<ЛКМ> - рисовать космос\n<ПКМ> - стирать космос",
		en = "<click> - draw space\n<right-click> - erase space"
	}
}